c5/src/Reports/BalanceSheet/BalanceSheet.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>BalanceSheet</name>
</mdclass:Report>

c5/src/ChartsOfCharacteristicTypes/Dimensions/Dimensions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Dimensions</name>
  <type>
    <types>EnumRef.FixedAssetGroups</types>
    <types>CatalogRef.Organizations</types>
    <types>CatalogRef.FixedAssets</types>
    <types>CatalogRef.Expenses</types>
    <types>CatalogRef.Warehouses</types>
    <types>ChartOfCalculationTypesRef.Compensations</types>
    <types>CatalogRef.Employees</types>
    <types>CatalogRef.Addresses</types>
    <types>CatalogRef.Taxes</types>
    <types>CatalogRef.PaymentLocations</types>
    <types>CatalogRef.Contracts</types>
    <types>CatalogRef.Departments</types>
    <types>CatalogRef.Dimensions</types>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.Individuals</types>
    <types>String</types>
    <types>CatalogRef.IntangibleAssets</types>
    <types>CatalogRef.BankAccounts</types>
    <types>CatalogRef.CashFlows</types>
    <types>CatalogRef.VAT</types>
    <types>EnumRef.IncomeCodes</types>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Addresses</name>
      <description>Addresses</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Addresses</types>
      </type>
    </items>
    <items>
      <name>AssetsCategories</name>
      <description>Assets Categories</description>
      <code>000000016</code>
      <type>
        <types>EnumRef.FixedAssetGroups</types>
      </type>
    </items>
    <items>
      <name>BankAccounts</name>
      <description>Bank Accounts</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.BankAccounts</types>
      </type>
    </items>
    <items>
      <name>CashFlows</name>
      <description>Cash Flows</description>
      <code>000000015</code>
      <type>
        <types>CatalogRef.CashFlows</types>
      </type>
    </items>
    <items>
      <name>Compensations</name>
      <description>Compensations</description>
      <code>000000014</code>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </items>
    <items>
      <name>Contracts</name>
      <description>Contracts</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </items>
    <items>
      <name>Departments</name>
      <description>Departments</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </items>
    <items>
      <name>Employees</name>
      <description>Employees</description>
      <code>000000013</code>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.Expenses</types>
      </type>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </items>
    <items>
      <name>IncomeCodes</name>
      <description>Income Tax Codes</description>
      <code>000000018</code>
      <type>
        <types>EnumRef.IncomeCodes</types>
      </type>
    </items>
    <items>
      <name>IntangibleAssets</name>
      <description>Intangible Assets</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </items>
    <items>
      <name>Items</name>
      <description>Items</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </items>
    <items>
      <name>Organizations</name>
      <description>Organizations</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </items>
    <items>
      <name>PaymentLocations</name>
      <description>Payment Locations</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.PaymentLocations</types>
      </type>
    </items>
    <items>
      <name>Taxes</name>
      <description>Taxes</description>
      <code>000000017</code>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </items>
    <items>
      <name>VAT</name>
      <description>VAT</description>
      <code>000000019</code>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </items>
    <items>
      <name>Warehouses</name>
      <description>Warehouses</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>DescriptionRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

c5/src/Reports/BalanceSheet/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function Events () export
	
	p = Reporter.Events ();
	p.BeforeOpen = true;
	p.OnDetail = true;
	p.OnCompose = true;
	return p;
	
EndFunction 

Procedure BeforeOpen ( Form ) export
	
	Form.GenerateOnOpen = true;
	
EndProcedure 

Procedure OnDetail ( Menu, StandardMenu, UseMainAction, Filters ) export
	
	Reporter.DisableMenu ( StandardMenu );
	Menu = new ValueList ();
	Reporter.AddReport ( Menu, "AccountBalance" );
	Reporter.AddReport ( Menu, "AccountAnalysis" );
	Reporter.AddReport ( Menu, "Transactions" );
	
EndProcedure

Procedure ApplyDetails ( Composer, Params ) export
	
	filters = GetFromTempStorage ( Params.Filters );
	balanceSheet = Params.ReportName = "BalanceSheet";
	analyticTransactions = Params.ReportName = "AnalyticTransactions";
	parent = Params.Parent;
	incomeStatement = false;
	debts = false;
	debtDetails = false;
	if ( parent = "IncomeStatement" ) then
		incomeStatement = true;
	elsif ( parent = "Debts"
		or parent = "VendorDebts" ) then
		debts = true;
	elsif ( parent = "DebtDetails"
		or parent = "VendorDebtDetails" ) then
		debtDetails = true;
	endif;
	periodDefined = false;
	filterType = Type ( "DataCompositionFilterItem" );
	for each filter in filters do
		filterName = filter.Name;
		if ( filterName = "Class" ) then
			if ( balanceSheet ) then
				DC.SetFilter ( Composer, "Account.Class", filter.Item.Value, , true );
				filter.StandardProcessing = false;
			endif;
		elsif ( filterName = "Period" ) then
			filter.StandardProcessing = false;
			if ( periodDefined ) then
				continue;
			endif;
			if ( filter.Field ) then
				if ( incomeStatement ) then
					period = getPeriod ( filter.Item.Value, filters );
				else
					period = filter.Item.Value;
				endif; 
				DC.SetParameter ( Composer, "Period", period );
			elsif ( filter.Parameter ) then
				DC.SetParameter ( Composer, "Period", filter.Item.Value );
			endif; 
			periodDefined = true;
		elsif ( filterName = "Customer"
			or filterName = "Vendor" ) then
			if ( debts
				or debtDetails ) then
				if ( balanceSheet ) then
					DC.AddFilter ( Composer, "Dim1", filter.Item.Value, , true );
					DC.SetParameter ( Composer, "ShowDimensions", 1 );
				elsif ( analyticTransactions ) then
					DC.SetParameter ( Composer, "DimType1", ChartsOfCharacteristicTypes.Dimensions.Organizations );
					DC.SetParameter ( Composer, "Dim1", filter.Item.Value );
				endif; 
			endif; 
		elsif ( filterName = "Contract" ) then
			if ( debts
				or debtDetails ) then
				if ( balanceSheet ) then
					DC.AddFilter ( Composer, "Dim2", filter.Item.Value, , true );
					DC.SetParameter ( Composer, "ShowDimensions", 2 );
				elsif ( analyticTransactions ) then
					DC.SetParameter ( Composer, "DimType2", ChartsOfCharacteristicTypes.Dimensions.Contracts );
					DC.SetParameter ( Composer, "Dim2", filter.Item.Value );
				endif; 
			endif; 
		elsif ( filterName = "ReportDate" ) then
			if ( balanceSheet
				or analyticTransactions ) then
				if ( debts ) then
					Reporter.DateToPeriod ( Composer, filter );
					periodDefined = true;
				endif; 
			endif;
		elsif ( filter.Filter
			and TypeOf ( filter.Item ) = filterType ) then
			userFilter = "" + filter.Item.LeftValue;
			if ( userFilter = "Currency" ) then
				if ( debts
					or debtDetails ) then
					if ( balanceSheet
						or analyticTransactions ) then
						filter.StandardProcessing = filter.Item.RightValue <> Application.Currency ();
					endif; 
				endif; 
			endif; 
		endif;
	enddo; 
	Reporter.ApplyDetails ( Composer, filters );
	
EndProcedure 

Function getPeriod ( Period, Filters )
	
	start = Period;
	end = Period;
	for each filter in Filters do
		if ( filter.Name = "Periodicity"
			and filter.Parameter ) then
			periodicity = filter.Item.Value;
			if ( periodicity = 2 ) then
				end = EndOfWeek ( Period );
			elsif ( periodicity = 3 ) then
				end = start + 10 * 86400;
			elsif ( periodicity = 4 ) then
				End = AddMonth ( start, 1 );
			elsif ( periodicity = 5 ) then
				start = AddMonth ( start, 3 );
			elsif ( periodicity = 6 ) then
				start = AddMonth ( start, 6 );
			elsif ( periodicity = 7 ) then
				start = AddMonth ( start, 12 );
			endif; 
			break;
		endif; 
	enddo; 
	return new StandardPeriod ( start, EndOfDay ( end ) );
	
EndFunction 

Procedure SetTitle ( Params, Period, Account = undefined ) export
	
	s = Metadata.Reports [ Params.Name ].Presentation ();
	if ( Account <> undefined ) then
		s = s + ": " + Account;
	endif;
	if ( TypeOf ( Period ) = Type ( "Date" ) ) then
		if ( Period <> Date ( 1, 1, 1 ) ) then
			s = s + ", " + Output.AsOf () + " " + Format ( Period, "DF='MMMM dd, yyyy'" );
		endif;
	elsif ( Period.Use ) then
		value = Period.Value;
		s = s + ", " + PeriodPresentation ( value.StartDate, value.EndDate, "FP=true" );
	endif; 
	p = Params.Settings.OutputParameters.FindParameterValue ( new DataCompositionParameter ( "Title" ) );
	p.Value = s;
	
EndProcedure

#endif
